// List<Map<String, dynamic>> courses = [
//   {
//     'courseName': '离散数学',
//     'remarks': '高数！',
//     'color': [0, 151, 136],
//     'times': [
//       ['周二', '第一节', '第二节'],
//       ['周五', '第一节', '第二节']
//     ],
//     'teacherName': '张老师',
//     'weeks': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
//   },
//   {
//     'courseName': '美育教育',
//     'remarks': '美育',
//     'color': [234, 30, 99],
//     'times': [
//       ['周一', '第一节', '第二节'],
//     ],
//     'teacherName': '秦老师',
//     'weeks': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
//   },
//   {
//     'courseName': '面向对象程序设计',
//     'remarks': 'Java!',
//     'color': [33, 150, 243],
//     'times': [
//       ['周一', '第三节', '第四节'],
//       ['周一', '第七节', '第八节']
//     ],
//     'teacherName': '焦老师',
//     'weeks': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
//   },
//   {
//     'courseName': '数据结构',
//     'remarks': '数据结构！',
//     'color': [138, 86, 244],
//     'times': [
//       ['周四', '第三节', '第四节'],
//       ['周四', '第七节', '第八节']
//     ],
//     'teacherName': '张老师',
//     'weeks': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
//   },
//   {
//     'courseName': '线性代数',
//     'remarks': '高数！',
//     'color': [244, 66, 54],
//     'times': [
//       ['周四', '第一节', '第二节'],
//     ],
//     'teacherName': '张老师',
//     'weeks': [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17]
//   }
// ];

//   // {
//   //   'row': 1,
//   //   'col': 1,
//   //   'name': '美育教育',
//   //   'teacher': '老师一',
//   //   'weeks': '2-17周',
//   //   'color': Colors.pink
//   // },
//   // {
//   //   'row': 1,
//   //   'col': 2,
//   //   'name': '离散数学',
//   //   'teacher': '老师一',
//   //   'weeks': '2-15周',
//   //   'color': Colors.teal
//   // },
//   // {
//   //   'row': 1,
//   //   'col': 4,
//   //   'name': '线性代数',
//   //   'teacher': '老师一',
//   //   'weeks': '2-17周',
//   //   'color': Colors.blue
//   // },
//   // {
//   //   'row': 2,
//   //   'col': 1,
//   //   'name': '面向对象程序设计',
//   //   'teacher': '老师一',
//   //   'weeks': '2-15周',
//   //   'color': Colors.red
//   // },
//   // {
//   //   'row': 2,
//   //   'col': 4,
//   //   'name': '数据结构',
//   //   'teacher': '老师一',
//   //   'weeks': '2-17周',
//   //   'color': Colors.orange
//   // },
//   // {
//   //   'row': 1,
//   //   'col': 5,
//   //   'name': '离散数学',
//   //   'teacher': '老师一',
//   //   'weeks': '2-15周',
//   //   'color': Colors.teal
//   // },
//   // {
//   //   'row': 4,
//   //   'col': 1,
//   //   'name': '面向对象程序设计',
//   //   'teacher': '老师一二',
//   //   'weeks': '2-15周',
//   //   'color': Colors.red
//   // },
//   // {
//   //   'row': 4,
//   //   'col': 4,
//   //   'name': '数据结构',
//   //   'teacher': '老师一二',
//   //   'weeks': '2-17周',
//   //   'color': Colors.orange
//   // },
